Project/Toir.Adaptation/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="72c7b58c-2134-4ea4-a093-6a7b6bde4dde">
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6245ad7c-d63f-4ba1-b08b-cfea682f5233">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="05b9fd1c-2f5a-4c5b-aacc-99a73f0ea883">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcbb889-225d-4201-a516-de6ba512a5f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61c5c699-fd38-4321-ab3d-405fc46cd6b9">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция ПолучитьДанныеРегистра
//
// Описание: Возвращает таблицу значений с колонками Должность и квалификация 
// 		с данными в разрезе организации и подразделение на определенную дату
//
// Параметры
//  Организация - СправочникСсылка.Организации - Организации
//  Подразделение - СправочникСсылка.СтруктураПредприятия – Подразделение
//  Должность - СправочникСсылка.Должности - Должность
//  Период - Дата – Дата, на которую получают данные, если не указана - то текущая дата сеанса	
//
// Возвращаемое значение: ТаблицаЗначений 
//   
Функция ПолучитьДанныеРегистра(Организация, Подразделение, Должность = Неопределено, Период = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();		
	КонецЕсли; 

	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Соответствия.Должность КАК Должность,
		|	Соответствия.Квалификация КАК Квалификация
		|ИЗ
		|	РегистрСведений.гкс_СоответствияДолжностейИКвалификаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Должность = &Должность) КАК Соответствия";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Если ЗначениеЗаполнено(Должность) Тогда
		Запрос.УстановитьПараметр("Должность", Должность);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"И Должность = &Должность", "");
	КонецЕсли; 
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции 

#КонецОбласти
